src/Catalogs/LocaleStrings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>LocaleStrings</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Configurations</xr:Item>
				<xr:Item>Catalog.AccountingRegisters</xr:Item>
				<xr:Item>Catalog.Forms</xr:Item>
				<xr:Item>Catalog.Attributes</xr:Item>
				<xr:Item>Catalog.StandardAttributes</xr:Item>
				<xr:Item>Catalog.AccumulationRegisters</xr:Item>
				<xr:Item>Catalog.InformationRegisters</xr:Item>
				<xr:Item>Catalog.Catalogs</xr:Item>
				<xr:Item>Catalog.Documents</xr:Item>
				<xr:Item>Catalog.TabularSections</xr:Item>
				<xr:Item>Catalog.Commands</xr:Item>
				<xr:Item>Catalog.Templates</xr:Item>
				<xr:Item>Catalog.CommonModules</xr:Item>
				<xr:Item>Catalog.Constants</xr:Item>
				<xr:Item>Catalog.Enums</xr:Item>
				<xr:Item>Catalog.EnumValues</xr:Item>
				<xr:Item>Catalog.FunctionalOptions</xr:Item>
				<xr:Item>Catalog.Roles</xr:Item>
				<xr:Item>Catalog.SessionParameters</xr:Item>
				<xr:Item>Catalog.DataProcessors</xr:Item>
				<xr:Item>Catalog.Reports</xr:Item>
				<xr:Item>Catalog.BusinessProcesses</xr:Item>
				<xr:Item>Catalog.Tasks</xr:Item>
				<xr:Item>Catalog.ChartsOfAccounts</xr:Item>
				<xr:Item>Catalog.ChartsOfCharacteristicTypes</xr:Item>
				<xr:Item>Catalog.ChartsOfCalculationTypes</xr:Item>
				<xr:Item>Catalog.CommonAttributes</xr:Item>
				<xr:Item>Catalog.CalculationRegisters</xr:Item>
				<xr:Item>Catalog.CommandGroups</xr:Item>
				<xr:Item>Catalog.CommonPictures</xr:Item>
				<xr:Item>Catalog.DocumentJournals</xr:Item>
				<xr:Item>Catalog.DocumentNumerators</xr:Item>
				<xr:Item>Catalog.EventSubscriptions</xr:Item>
				<xr:Item>Catalog.ExchangePlans</xr:Item>
				<xr:Item>Catalog.FilterCriteria</xr:Item>
				<xr:Item>Catalog.FunctionalOptionsParameters</xr:Item>
				<xr:Item>Catalog.ScheduledJobs</xr:Item>
				<xr:Item>Catalog.Sequences</xr:Item>
				<xr:Item>Catalog.SettingsStorages</xr:Item>
				<xr:Item>Catalog.HTTPServices</xr:Item>
				<xr:Item>Catalog.WebServices</xr:Item>
				<xr:Item>Catalog.WSReferences</xr:Item>
				<xr:Item>Catalog.XDTOPackages</xr:Item>
				<xr:Item>Catalog.Subsystems</xr:Item>
				<xr:Item>Catalog.CommonCommands</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Config</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Configurations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SHA1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Values</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Language</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Languages</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/LocaleStrings/Ext/ManagerModule.bsl
Procedure PresentationFieldsGetProcessing(Fields, StandardProcessing)
	
	StandardProcessing = False;
	
	Fields.Add("Config");
	Fields.Add("Ref");	
	
EndProcedure // PresentationFieldsGetProcessing()

Procedure PresentationGetProcessing(Data, Presentation, StandardProcessing)
	
	If ValueIsFilled(Data.Config) Then
		
		StandardProcessing = False;
		
		DefaultLanguage = Abc.AttributeValueFromCache(Data.Config, "DefaultLanguage");
		Presentation = Presentation(Data.Ref, DefaultLanguage);
		
	EndIf; 
	
EndProcedure // PresentationGetProcessing()

Function Presentation(Ref, Language)
	
	Query = New Query;
	Query.SetParameter("Ref", Ref);
	Query.SetParameter("Language", Language);
	Query.Text =
	"SELECT
	|	LocaleStringsValues.Value AS Value
	|FROM
	|	Catalog.LocaleStrings.Values AS LocaleStringsValues
	|WHERE
	|	LocaleStringsValues.Ref = &Ref
	|	AND LocaleStringsValues.Language = &Language";
	
	QueryResult = Query.Execute(); 
	
	If QueryResult.IsEmpty() Then
		Return "";
	EndIf; 
	
	Return QueryResult.Unload()[0].Value;
	
EndFunction // Presentation()

Function Load(Parameters) Export
	Var Ref;
	
	Config = Parameters.Config;
	Owner = Parameters.Owner;
	Path = Parameters.Path;
	LocalString = Parameters.LocalString;
	Ref  = Parameters.StringRef;
	
	SHA1 = SHA1(LocalString);
	
	StringCache = Meta.StringCache(Config);
	
	If ValueIsFilled(Ref) Then
		
		StringCacheItem = StringCache.Find(Ref, "Ref");
		If StringCacheItem <> Undefined And StringCacheItem.SHA1 = SHA1 Then
			Return Ref;
		EndIf;
		
		StringObject = Ref.GetObject();
		If StringObject.Owner <> Owner Then
			Raise "Call in violation of protocol";
		EndIf; 
		StringObject.Values.Clear();
		
	Else
		
		If LocalString.item.Count() = 0 Then
			Return Ref;
		EndIf;
		
		StringObject = Catalogs.LocaleStrings.CreateItem();
		StringObject.Owner = Owner;
		StringObject.Config = Config;
		
	EndIf;
	
	For Each LocalStringItem In LocalString.item Do
		
		Item = StringObject.Values.Add();
		Item.Language = Meta.LanguageByCodeFromCache(Config, LocalStringItem.Lang);
		Item.Value = LocalStringItem.Content;
		
	EndDo; 
	
	StringObject.SHA1 = SHA1;
	StringObject.Write();
	
	Return StringObject.Ref;
	
EndFunction // Load()

Function SHA1(LocalString) Export
	Var SHA1;
	
	DataHashing = New DataHashing(HashFunction.SHA1);
	
	For Each LocalStringItem In LocalString.item Do
		
		DataHashing.Append(LocalStringItem.Lang);
		DataHashing.Append(Format(StrLen(LocalStringItem.Content), "NZ=0; NG="));
		DataHashing.Append(LocalStringItem.Content);
		
	EndDo; 
	
	SHA1 = GetHexStringFromBinaryData(DataHashing.HashSum);
	
	Return SHA1;
	
EndFunction // SHA1()
